cmsis-svd/cmsis-svd/data/STMicro/STM32F7x7_v1r2.svd
        <register>
          <name>OTG_FS_DIEPINT1</name>
          <displayName>OTG_FS_DIEPINT1</displayName>
          <description>device endpoint-1 interrupt
          register</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>TXFE</name>
              <description>TXFE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEPNE</name>
              <description>INEPNE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITTXFE</name>
              <description>ITTXFE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOC</name>
              <description>TOC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISD</name>
              <description>EPDISD</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XFRC</name>
              <description>XFRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_FS_DIEPINT2</name>
          <displayName>OTG_FS_DIEPINT2</displayName>
          <description>device endpoint-2 interrupt
          register</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>TXFE</name>
              <description>TXFE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEPNE</name>
              <description>INEPNE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITTXFE</name>
              <description>ITTXFE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOC</name>
              <description>TOC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISD</name>
              <description>EPDISD</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XFRC</name>
              <description>XFRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_FS_DIEPINT3</name>
          <displayName>OTG_FS_DIEPINT3</displayName>
          <description>device endpoint-3 interrupt
          register</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>TXFE</name>
              <description>TXFE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEPNE</name>
              <description>INEPNE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITTXFE</name>
              <description>ITTXFE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOC</name>
              <description>TOC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISD</name>
              <description>EPDISD</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XFRC</name>
              <description>XFRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_FS_DOEPINT0</name>
          <displayName>OTG_FS_DOEPINT0</displayName>
          <description>device endpoint-0 interrupt
          register</description>
          <addressOffset>0x308</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>B2BSTUP</name>
              <description>B2BSTUP</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTEPDIS</name>
              <description>OTEPDIS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STUP</name>
              <description>STUP</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPDISD</name>
              <description>EPDISD</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XFRC</name>
              <description>XFRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_FS_DOEPINT1</name>
          <displayName>OTG_FS_DOEPINT1</displayName>
          <description>device endpoint-1 interrupt
          register</description>
          <addressOffset>0x328</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>B2BSTUP</name>
              <description>B2BSTUP</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTEPDIS</name>
              <description>OTEPDIS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STUP</name>
              <description>STUP</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPDISD</name>
              <description>EPDISD</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XFRC</name>
              <description>XFRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_FS_DOEPINT2</name>
          <displayName>OTG_FS_DOEPINT2</displayName>
          <description>device endpoint-2 interrupt
          register</description>
          <addressOffset>0x348</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>B2BSTUP</name>
              <description>B2BSTUP</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTEPDIS</name>
              <description>OTEPDIS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STUP</name>
              <description>STUP</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPDISD</name>
              <description>EPDISD</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XFRC</name>
              <description>XFRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_FS_DOEPINT3</name>
          <displayName>OTG_FS_DOEPINT3</displayName>
          <description>device endpoint-3 interrupt
          register</description>
          <addressOffset>0x368</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>B2BSTUP</name>
              <description>B2BSTUP</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTEPDIS</name>
              <description>OTEPDIS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STUP</name>
              <description>STUP</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPDISD</name>
              <description>EPDISD</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XFRC</name>
              <description>XFRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_FS_DIEPTSIZ0</name>
          <displayName>OTG_FS_DIEPTSIZ0</displayName>
          <description>device endpoint-0 transfer size
          register</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_FS_DOEPTSIZ0</name>
          <displayName>OTG_FS_DOEPTSIZ0</displayName>
          <description>device OUT endpoint-0 transfer size
          register</description>
          <addressOffset>0x310</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STUPCNT</name>
              <description>SETUP packet count</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_FS_DIEPTSIZ1</name>
          <displayName>OTG_FS_DIEPTSIZ1</displayName>
          <description>device endpoint-1 transfer size
          register</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCNT</name>
              <description>Multi count</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitOffset>19</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_FS_DIEPTSIZ2</name>
          <displayName>OTG_FS_DIEPTSIZ2</displayName>
          <description>device endpoint-2 transfer size
          register</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCNT</name>
              <description>Multi count</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitOffset>19</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_FS_DIEPTSIZ3</name>
          <displayName>OTG_FS_DIEPTSIZ3</displayName>
          <description>device endpoint-3 transfer size
          register</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCNT</name>
              <description>Multi count</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitOffset>19</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_FS_DTXFSTS0</name>
          <displayName>OTG_FS_DTXFSTS0</displayName>
          <description>OTG_FS device IN endpoint transmit FIFO
          status register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INEPTFSAV</name>
              <description>IN endpoint TxFIFO space
              available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_FS_DTXFSTS1</name>
          <displayName>OTG_FS_DTXFSTS1</displayName>
          <description>OTG_FS device IN endpoint transmit FIFO
          status register</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INEPTFSAV</name>
              <description>IN endpoint TxFIFO space
              available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_FS_DTXFSTS2</name>
          <displayName>OTG_FS_DTXFSTS2</displayName>
          <description>OTG_FS device IN endpoint transmit FIFO
          status register</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INEPTFSAV</name>
              <description>IN endpoint TxFIFO space
              available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_FS_DTXFSTS3</name>
          <displayName>OTG_FS_DTXFSTS3</displayName>
          <description>OTG_FS device IN endpoint transmit FIFO
          status register</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INEPTFSAV</name>
              <description>IN endpoint TxFIFO space
              available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_FS_DOEPTSIZ1</name>
          <displayName>OTG_FS_DOEPTSIZ1</displayName>
          <description>device OUT endpoint-1 transfer size
          register</description>
          <addressOffset>0x330</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXDPID_STUPCNT</name>
              <description>Received data PID/SETUP packet
              count</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitOffset>19</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_FS_DOEPTSIZ2</name>
          <displayName>OTG_FS_DOEPTSIZ2</displayName>
          <description>device OUT endpoint-2 transfer size
          register</description>
          <addressOffset>0x350</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXDPID_STUPCNT</name>
              <description>Received data PID/SETUP packet
              count</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitOffset>19</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_FS_DOEPTSIZ3</name>
          <displayName>OTG_FS_DOEPTSIZ3</displayName>
          <description>device OUT endpoint-3 transfer size
          register</description>
          <addressOffset>0x370</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXDPID_STUPCNT</name>
              <description>Received data PID/SETUP packet
              count</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitOffset>19</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
